//---39--------------------------------------------------
// Змініть масив myArray так, щоб він містив і рядок, і число (у цьому порядку).Змініть код лише під цим рядком
const myArray = ['Hey , Man', 2];
//----40----------------------------------------------
//Створіть вкладений масив під назвою myArray.

const myArray = [['ChikagoBulss'], [22]];

//----41----------------------------------------------
/*Створіть змінну з назвою myData і встановіть її значення
 рівне до першому елементу myArray, використовуючи квадратні дужки.*/

const myArray = [50, 60, 70];
const myData = myArray[0];
//----42----------------------------------------------
/*Змінюйте дані, що зберігаються в індексі 0 масиву myArray до значення 45.*/

// Налаштування
const myArray = [18, 64, 99];
myArray[0] = 45;
// Змініть код лише під цим рядком
//----43----------------------------------------------
/*За допомогою квадратних дужок виберіть елемент 
із myArray таким чином, щоб myData дорівнював 8.*/

const myArray = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9],
    [[10, 11, 12], 13, 14],
];

const myData = myArray[2][1];

//----44----------------------------------------------
/*Виштовхніть ["dog", 3] в кінець змінної myArray.*/
// Налаштування
const myArray = [["John", 23], ["cat", 2]];

// Змініть код лише під цим рядком
myArray.push(["dog", 3]);

//----45----------------------------------------------
/*Використовуйте функцію .pop(), щоб видалити останній елемент 
з myArray та призначити значення, яке виводиться для removedFromMyArray.*/
// Налаштування
const myArray = [["John", 23], ["cat", 2]];

// Змініть код лише під цим рядком
const removedFromMyArray = myArray.pop();

//----46----------------------------------------------
/*Використовуйте функцію .shift(), щоб видалити перший елемент з myArray та
 призначивши значення "викреслено" для нової змінної removedFromMyArray.*/

// Налаштування
const myArray = [["John", 23], ["dog", 3]];

// Змініть код лише під цим рядком
const removedFromMyArray = myArray.shift();

//----47----------------------------------------------
/*Додайте ["Paul", 35] на початок змінної myArray,
 використовуючи unshift(). */
// Налаштування
const myArray = [["John", 23], ["dog", 3]];
myArray.shift();

// Змініть код лише під цим рядком
myArray.unshift(["Paul", 35]);
//----48----------------------------------------------
/*У списку повинно бути щонайменше 5 підмасивів.*/
const myList = [
    ["Canned Beans", 3],
    ["Milk Galon", 1],
    ["Cereal", 2],
    ["Toilet Paper", 12],
    ["Sack of Rice", 1]
];
//----49----------------------------------------------
//Створіть функцію, яка називається reusableFunction,
//що друкує рядок Hi World на консоль розробників.
//Викличте функцію.
function reusableFunction() {
    console.log("Hi World");
};
reusableFunction();

//----50----------------------------------------------
/**Створіть функцію з назвою functionWithArgs, яка приймає 2 аргументи 
 * і виводить їхню суму в dev-консоль.
Викличте функцію з двома числами так, як аргументи. */

function functionWithArgs(a, b) {
    console.log(a + b);
}
functionWithArgs(1, 2);
functionWithArgs(7, 9);

//----51----------------------------------------------
/**Створіть функцію timesFive, що приймає один аргумент,
 *  множить його на 5 і повертає нове значення. */

function timesFive(num) {
    return num * 5;
}

const answer = timesFive(5);
const answer1 = timesFive(2);
const answer2 = timesFive(0);

//----52----------------------------------------------
/**Використовуючи let чи const, визначте глобальну змінну myGlobal поза будь-якою функцією.
 *  Привласніть їй значення 10.
Призначте 5 для oopsGlobal всередині функції fun1 
не використовуючи ключове слово let чи const. */

// Вкажіть змінну myGlobal під цим рядком
let myGlobal = 10

function fun1() {
    // Призначте 5 oopsGlobal тут
    oopsGlobal = 5
}

// Змініть код лише над цим рядком

function fun2() {
    var output = "";
    if (typeof myGlobal != "undefined") {
        output += "myGlobal: " + myGlobal;
    }
    if (typeof oopsGlobal != "undefined") {
        output += " oopsGlobal: " + oopsGlobal;
    }
    console.log(output);
}

//----53----------------------------------------------
/* Редактор має два console.log щоб допомогти вам побачити, що відбувається. 
Позначте консоль як ваш код, щоб побачити як вона змінюється. 
Зазначте локальну змінну e myVar всередині myLocalScope і запустіть тест.
Консоль Note: все ще відображатиме ReferenceError: myVar is not defined, але це не спричинить збій тестувань.*/

function myLocalScope() {
    // Змініть код лише під цим рядком
    let myVar;
    console.log('inside myLocalScope', myVar);
}
myLocalScope();

// Запустіть та перевірте консоль
// myVar не визначений за межеми myLocalScope
console.log('outside myLocalScope', myVar);

//----54----------------------------------------------
/**Додайте локальну змінну до функції myOutfit,
 * щоб перевизначити значення outerWear з рядком sweater. */
// Налаштування
const outerWear = "T-Shirt";

function myOutfit() {
    // Змініть код лише під цим рядком
    const outerWear = "sweater";
    // Змініть код лише над цим рядком
    return outerWear;
}

myOutfit();
//----55----------------------------------------------
/**Створіть функцію addFive без аргументів. Ця функція додає 5 до sum (суми) змінної, 
 * але повернене значення є undefined. */

// Налаштування
let sum = 0;

function addThree() {
  sum = sum + 3;
}

// Змініть код лише під цим рядком
function addFive(){
sum += 5;
}
// Змініть код лише над цим рядком

addThree();
addFive();