/* Встановіть remainder, що дорівнює залишку 11 поділеного на 3 використовуючи оператор remainder (%)
1. Змінна remainder повинна бути ініціалізованою
2. Значення remainder повинне бути 2
3. Вам слід використовувати оператор %
const remainder = 0; */

var remainder = 11 % 3;

//--------------------------------------------------------
//Конвертуйте присвоєння для a, b, та c, 
//щоб використати оператор +=.

let a = 3;
let b = 17;
let c = 12;

// Змініть код лише під цим рядком
a = a += 12;
b = b += 9;
c = c += 7;
//--------------------------------------------------------
//Перетворіть присвоєння для a, b, і c, 
//щоб використати оператор -=.

let a = 11;
let b = 9;
let c = 3;

// Змініть код лише під цим рядком
a = a -= 6;
b = b -= 15;
c = c -= 1;

//--------------------------------------------------------
//Перетворіть присвоєння для a, b, і c,
//щоб використати оператор *=.

let a = 5;
let b = 12;
let c = 4.6;

// Змініть код лише під цим рядком
a = a *= 5;
b = b *= 3;
c = c *= 10;

//--------------------------------------------------------
//Конвертуйте присвоєння для a, b, та c,
// щоб використати оператор /=.

let a = 48;
let b = 108;
let c = 33;

// Змініть код лише під цим рядком
a = a /= 12;
b = b /= 4;
c = c /= 11;
//--------------------------------------------------------
//Змініть поданий рядок на рядок з одинарними лапками 
//на початку і в кінці та не використовуйте екрановані символи.
//Зараз тег <a> у рядку може використовувати всюди подвійні лапки. 
//Вам потрібно буде змінити зовнішні лапки на одинарні лапки, щоб видалити екрановані символи.
const myStr = '<a href="http://www.example.com" target="_blank">Link</a>';

//--------------------------------------------------------
/*Задайте наступні 3 рядки тексту в єдину змінну myStr, 
використовуючи екрановану послідовність.
Щоб правильно встановити спеціальні символи,
потрібно використовувати екрановану послідовність. 
Також потрібно дотримуватись інтервалу, як це виглядає вище,
без пробілів між екранованими послідовностями або словами.
Примітка: Відступ для SecondLine досягається за допомогою символу екранування вкладки, 
а не пробілів*/

const myStr = "FirstLine\n\t\\SecondLine\nThirdLine"; // Змініть цей рядок

//--------------------------------------------------------
/*Створіть myStr з рядків This is the start. й This is the end. 
за допомогою + оператору. Обов'язково використовуйте пробіл між двома рядками.*/

const myStr = "This is the start." + " This is the end."; // Змініть цей рядок

//--------------------------------------------------------
/*Введіть myStr над кількома рядками, об'єднуючи ці два рядки: 
This is the first sentence. і This is the second sentence.. 
Використовуйте оператор +=. Використовуйте += оператор, подібний до того, 
як показно в прикладі, й обов'язково зверніть увагу на наявність пробіл між рядками. 
Почніть з призначення першого рядка myStr, а потім додайте до другого рядка.*/

var myStr ="This is the first sentence.";
myStr +=" This is the second sentence.";

//--------------------------------------------------------
/*Вставте myName у рядок з вашим іменем і 
створіть myStr з myName між рядками 
My name is і and I am well!*/
// Змініть код лише під цим рядком
const myName = "Eugene";
const myStr = "My name is" + myName + "and I am well!";

//--------------------------------------------------------
/*Встановіть someAdjective у рядку із щонайменше 3 символів і 
додайте його до myStr, використовуючи знаки +=.*/
// Змініть код під цим рядком


const someAdjective = "awesome";
let myStr = "Learning to code is ";
myStr += someAdjective;

//--------------------------------------------------------
/*Змініть код лише під цим рядком
Використовуйте властивість .length, 
щоб вирахувати кількість символів у змінній 
lastName і призначити її до lastNameLength.*/

// Налаштування
let lastNameLength = 0;
const lastName = "Lovelace";

// Змініть код лише під цим рядком
lastNameLength = lastName.length;
//--------------------------------------------------------
/* Використовуйте дужкову нотацію, щоб знайти перший символ в змінній 
lastName та задайте його до firstLetterOfLastName.
**Підказка:**Спробуйте подивитися на приклад вище, якщо застрягли.*/

// Налаштування
let firstLetterOfLastName = "";
const lastName = "Lovelace";

// Змініть код лише під цим рядком
firstLetterOfLastName = lastName[0]; // Змініть цей рядок
//--------------------------------------------------------
/* Виправте призначення myStr так, щоб код містив рядок зі значенням Hello World, 
використовуючи підхід, показаний вище.*/

// Setup
var myStr = "Jello World";
// Only change code below this line
myStr = "Hello World";

//--------------------------------------------------------
/* Спробуйте встановити thirdLetterOfLastName на 
рівні третьої літери змінної lastName,
 використовуючи дужкову нотацію. */

 // Налаштування
const lastName = "Lovelace";

// Змініть код лише під цим рядком
const thirdLetterOfLastName = lastName[2]; // Змініть цей рядок

//--------------------------------------------------------
/* Використовуйте дужкову нотацію, щоб знайти 
останній символ у змінній lastName. */
// Налаштування
const lastName = "Lovelace";

// Змініть код лише під цим рядком
const lastLetterOfLastName = lastName[lastName.length -1]; // Змініть цей рядок


//--------------------------------------------------------
/*Використовуйте дужкову нотацію для пошуку передостаннього символу в lastName в рядку. */

// Налаштування
const lastName = "Lovelace";

// Змініть код лише під цим рядком
const secondToLastLetterOfLastName = lastName; // Змініть цей рядок

//--------------------------------------------------------
/**Використовуйте дужкову нотацію для пошуку передостаннього символу в lastName в рядку. */

// Налаштування
const lastName = "Lovelace";

// Змініть код лише під цим рядком
const secondToLastLetterOfLastName = lastName[lastName.length - 2]; 
// Змініть цей рядок

//--------------------------------------------------------
const myNoun = "dog";
const myAdjective = "big";
const myVerb = "ran";
const myAdverb = "quickly";

// Змініть код лише під цим рядком
const wordBlanks = "The " + myAdjective + " " + myNoun + " "+ myVerb +" "+ myAdverb +"."; // Змініть цей рядок